Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xab (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x2e6b): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xdb8): ../Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x2fb0): /home/fikrat/CPlus_Tutorial/Embedded_C/myworkspace/target/000SizeOf/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x2821): signed char
 <1><30>: Abbrev Number: 2 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 1
    <32>   DW_AT_encoding    : 8	(unsigned char)
    <33>   DW_AT_name        : (indirect string, offset: 0x2a25): unsigned char
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 2
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x730): short int

    <108>   DW_AT_name        : (indirect string, offset: 0x60e3): __uint32_t
    <10c>   DW_AT_decl_file   : 2
    <10d>   DW_AT_decl_line   : 79
    <10e>   DW_AT_decl_column : 25
    <10f>   DW_AT_type        : <0x113>
 <1><113>: Abbrev Number: 2 (DW_TAG_base_type)
    <114>   DW_AT_byte_size   : 4
    <115>   DW_AT_encoding    : 7	(unsigned)
    <116>   DW_AT_name        : (indirect string, offset: 0x2403): long unsigned int
 <1><11a>: Abbrev Number: 2 (DW_TAG_base_type)
    <11b>   DW_AT_byte_size   : 8
    <11c>   DW_AT_encoding    : 5	(signed)
    <11d>   DW_AT_name        : (indirect string, offset: 0x215b): long long int
 <1><121>: Abbrev Number: 2 (DW_TAG_base_type)
    <122>   DW_AT_byte_size   : 8
    <123>   DW_AT_encoding    : 7	(unsigned)
    <124>   DW_AT_name        : (indirect string, offset: 0x355b): long long unsigned int
 <1><128>: Abbrev Number: 3 (DW_TAG_typedef)
    <129>   DW_AT_name        : (indirect string, offset: 0x4aa4): __int_least64_t
    <12d>   DW_AT_decl_file   : 2
    <12e>   DW_AT_decl_line   : 200
    <12f>   DW_AT_decl_column : 30
    <130>   DW_AT_type        : <0x11a>
 <1><134>: Abbrev Number: 4 (DW_TAG_base_type)
    <135>   DW_AT_byte_size   : 4
    <136>   DW_AT_encoding    : 5	(signed)
    <137>   DW_AT_name        : int
 <1><13b>: Abbrev Number: 2 (DW_TAG_base_type)
    <13c>   DW_AT_byte_size   : 4
    <13d>   DW_AT_encoding    : 7	(unsigned)
    <13e>   DW_AT_name        : (indirect string, offset: 0x31ec): unsigned int
 <1><142>: Abbrev Number: 2 (DW_TAG_base_type)
    <143>   DW_AT_byte_size   : 8
    <144>   DW_AT_encoding    : 4	(float)
    <145>   DW_AT_name        : (indirect string, offset: 0x3c3b): long double
 <1><149>: Abbrev Number: 3 (DW_TAG_typedef)
    <14a>   DW_AT_name        : (indirect string, offset: 0x64d5): __blkcnt_t
    <14e>   DW_AT_decl_file   : 3
    <14f>   DW_AT_decl_line   : 30
    <150>   DW_AT_decl_column : 14
    <151>   DW_AT_type        : <0x100>
 <1><155>: Abbrev Number: 3 (DW_TAG_typedef)
    <156>   DW_AT_name        : (indirect string, offset: 0x4b87): __blksize_t
    <15a>   DW_AT_decl_file   : 3
    <15b>   DW_AT_decl_line   : 34
    <15c>   DW_AT_decl_column : 14
    <15d>   DW_AT_type        : <0x100>
 <1><161>: Abbrev Number: 3 (DW_TAG_typedef)
    <162>   DW_AT_name        : (indirect string, offset: 0x59e4): _off_t
    <166>   DW_AT_decl_file   : 3
    <167>   DW_AT_decl_line   : 46
    <168>   DW_AT_decl_column : 14
    <169>   DW_AT_type        : <0x100>
 <1><16d>: Abbrev Number: 3 (DW_TAG_typedef)
    <16e>   DW_AT_name        : (indirect string, offset: 0x4564): __dev_t
    <172>   DW_AT_decl_file   : 3
    <173>   DW_AT_decl_line   : 56
    <174>   DW_AT_decl_column : 15
    <175>   DW_AT_type        : <0xf2>
 <1><179>: Abbrev Number: 3 (DW_TAG_typedef)
    <17a>   DW_AT_name        : (indirect string, offset: 0x8991): __uid_t
    <17e>   DW_AT_decl_file   : 3
    <17f>   DW_AT_decl_line   : 60
    <180>   DW_AT_decl_column : 24
    <181>   DW_AT_type        : <0xf9>
 <1><185>: Abbrev Number: 3 (DW_TAG_typedef)
    <186>   DW_AT_name        : (indirect string, offset: 0x8964): __gid_t
    <18a>   DW_AT_decl_file   : 3
    <18b>   DW_AT_decl_line   : 63
    <18c>   DW_AT_decl_column : 24
    <18d>   DW_AT_type        : <0xf9>
 <1><191>: Abbrev Number: 3 (DW_TAG_typedef)
    <192>   DW_AT_name        : (indirect string, offset: 0x65d8): __ino_t
    <196>   DW_AT_decl_file   : 3
    <197>   DW_AT_decl_line   : 75
    <198>   DW_AT_decl_column : 24
    <199>   DW_AT_type        : <0xf9>
 <1><19d>: Abbrev Number: 3 (DW_TAG_typedef)
    <19e>   DW_AT_name        : (indirect string, offset: 0x5504): __mode_t
    <1a2>   DW_AT_decl_file   : 3
    <1a3>   DW_AT_decl_line   : 90
    <1a4>   DW_AT_decl_column : 20
    <1a5>   DW_AT_type        : <0x107>
 <1><1a9>: Abbrev Number: 3 (DW_TAG_typedef)
    <1aa>   DW_AT_name        : (indirect string, offset: 0x59e3): __off_t
    <1ae>   DW_AT_decl_file   : 3
    <1af>   DW_AT_decl_line   : 102
    <1b0>   DW_AT_decl_column : 16
    <1b1>   DW_AT_type        : <0x161>
 <1><1b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x8fe2): __nlink_t
    <1ba>   DW_AT_decl_file   : 3
    <1bb>   DW_AT_decl_line   : 209
    <1bc>   DW_AT_decl_column : 24
    <1bd>   DW_AT_type        : <0xf9>
 <1><1c1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1c2>   DW_AT_byte_size   : 4
    <1c3>   DW_AT_type        : <0x1c7>
 <1><1c7>: Abbrev Number: 2 (DW_TAG_base_type)
    <1c8>   DW_AT_byte_size   : 1
    <1c9>   DW_AT_encoding    : 8	(unsigned char)
    <1ca>   DW_AT_name        : (indirect string, offset: 0x2828): char
 <1><1ce>: Abbrev Number: 3 (DW_TAG_typedef)
    <1cf>   DW_AT_name        : (indirect string, offset: 0x454d): uint8_t
    <1d3>   DW_AT_decl_file   : 4
    <1d4>   DW_AT_decl_line   : 24
    <1d5>   DW_AT_decl_column : 19
    <1d6>   DW_AT_type        : <0xdf>
 <1><1da>: Abbrev Number: 3 (DW_TAG_typedef)
    <1db>   DW_AT_name        : (indirect string, offset: 0x60e5): uint32_t
    <1df>   DW_AT_decl_file   : 4
    <1e0>   DW_AT_decl_line   : 48
    <1e1>   DW_AT_decl_column : 20
    <1e2>   DW_AT_type        : <0x107>
 <1><1e6>: Abbrev Number: 3 (DW_TAG_typedef)
    <1e7>   DW_AT_name        : (indirect string, offset: 0x3ff7): time_t
    <1eb>   DW_AT_decl_file   : 5
    <1ec>   DW_AT_decl_line   : 42
    <1ed>   DW_AT_decl_column : 18
    <1ee>   DW_AT_type        : <0x128>
 <1><1f2>: Abbrev Number: 6 (DW_TAG_structure_type)
    <1f3>   DW_AT_name        : (indirect string, offset: 0x76d6): timespec
    <1f7>   DW_AT_byte_size   : 16
    <1f8>   DW_AT_decl_file   : 6
    <1f9>   DW_AT_decl_line   : 47
    <1fa>   DW_AT_decl_column : 8
    <1fb>   DW_AT_sibling     : <0x21a>
 <2><1ff>: Abbrev Number: 7 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0x3dd4): tv_sec
    <204>   DW_AT_decl_file   : 6
    <205>   DW_AT_decl_line   : 48
    <206>   DW_AT_decl_column : 9
    <207>   DW_AT_type        : <0x1e6>
    <20b>   DW_AT_data_member_location: 0
 <2><20c>: Abbrev Number: 7 (DW_TAG_member)
    <20d>   DW_AT_name        : (indirect string, offset: 0x840b): tv_nsec
    <211>   DW_AT_decl_file   : 6
    <212>   DW_AT_decl_line   : 49
    <213>   DW_AT_decl_column : 7
    <214>   DW_AT_type        : <0x100>
    <218>   DW_AT_data_member_location: 8
 <2><219>: Abbrev Number: 0
 <1><21a>: Abbrev Number: 3 (DW_TAG_typedef)
    <21b>   DW_AT_name        : (indirect string, offset: 0x64d7): blkcnt_t
    <21f>   DW_AT_decl_file   : 7
    <220>   DW_AT_decl_line   : 97
    <221>   DW_AT_decl_column : 20
    <222>   DW_AT_type        : <0x149>
 <1><226>: Abbrev Number: 3 (DW_TAG_typedef)
    <227>   DW_AT_name        : (indirect string, offset: 0x4b89): blksize_t
    <22b>   DW_AT_decl_file   : 7
    <22c>   DW_AT_decl_line   : 102
    <22d>   DW_AT_decl_column : 21
    <22e>   DW_AT_type        : <0x155>
 <1><232>: Abbrev Number: 3 (DW_TAG_typedef)
    <233>   DW_AT_name        : (indirect string, offset: 0x785e): clock_t
    <237>   DW_AT_decl_file   : 7
    <238>   DW_AT_decl_line   : 107
    <239>   DW_AT_decl_column : 19
    <23a>   DW_AT_type        : <0x113>
 <1><23e>: Abbrev Number: 3 (DW_TAG_typedef)
    <23f>   DW_AT_name        : (indirect string, offset: 0x65da): ino_t
    <243>   DW_AT_decl_file   : 7
    <244>   DW_AT_decl_line   : 139
    <245>   DW_AT_decl_column : 18
    <246>   DW_AT_type        : <0x191>
 <1><24a>: Abbrev Number: 3 (DW_TAG_typedef)
    <24b>   DW_AT_name        : (indirect string, offset: 0x59e5): off_t
    <24f>   DW_AT_decl_file   : 7
    <250>   DW_AT_decl_line   : 157
    <251>   DW_AT_decl_column : 18
    <252>   DW_AT_type        : <0x1a9>
 <1><256>: Abbrev Number: 3 (DW_TAG_typedef)
    <257>   DW_AT_name        : (indirect string, offset: 0x4566): dev_t
    <25b>   DW_AT_decl_file   : 7
    <25c>   DW_AT_decl_line   : 161
    <25d>   DW_AT_decl_column : 18
    <25e>   DW_AT_type        : <0x16d>
 <1><262>: Abbrev Number: 3 (DW_TAG_typedef)
    <263>   DW_AT_name        : (indirect string, offset: 0x8993): uid_t
    <267>   DW_AT_decl_file   : 7
    <268>   DW_AT_decl_line   : 165
    <269>   DW_AT_decl_column : 18
    <26a>   DW_AT_type        : <0x179>
 <1><26e>: Abbrev Number: 3 (DW_TAG_typedef)
    <26f>   DW_AT_name        : (indirect string, offset: 0x8966): gid_t
    <273>   DW_AT_decl_file   : 7
    <274>   DW_AT_decl_line   : 169
    <275>   DW_AT_decl_column : 18
    <276>   DW_AT_type        : <0x185>
 <1><27a>: Abbrev Number: 3 (DW_TAG_typedef)
    <27b>   DW_AT_name        : (indirect string, offset: 0x5506): mode_t
    <27f>   DW_AT_decl_file   : 7
    <280>   DW_AT_decl_line   : 189
    <281>   DW_AT_decl_column : 18
    <282>   DW_AT_type        : <0x19d>
 <1><286>: Abbrev Number: 3 (DW_TAG_typedef)
    <287>   DW_AT_name        : (indirect string, offset: 0x8fe4): nlink_t
    <28b>   DW_AT_decl_file   : 7
    <28c>   DW_AT_decl_line   : 194
    <28d>   DW_AT_decl_column : 19
    <28e>   DW_AT_type        : <0x1b5>
 <1><292>: Abbrev Number: 6 (DW_TAG_structure_type)
    <293>   DW_AT_name        : (indirect string, offset: 0x8a9d): stat
    <297>   DW_AT_byte_size   : 88
    <298>   DW_AT_decl_file   : 8
    <299>   DW_AT_decl_line   : 27
    <29a>   DW_AT_decl_column : 8
    <29b>   DW_AT_sibling     : <0x356>
 <2><29f>: Abbrev Number: 7 (DW_TAG_member)
    <2a0>   DW_AT_name        : (indirect string, offset: 0x767b): st_dev
    <2a4>   DW_AT_decl_file   : 8
    <2a5>   DW_AT_decl_line   : 29
    <2a6>   DW_AT_decl_column : 10
    <2a7>   DW_AT_type        : <0x256>
    <2ab>   DW_AT_data_member_location: 0
 <2><2ac>: Abbrev Number: 7 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x8fa3): st_ino
    <2b1>   DW_AT_decl_file   : 8
    <2b2>   DW_AT_decl_line   : 30
    <2b3>   DW_AT_decl_column : 10
    <2b4>   DW_AT_type        : <0x23e>
    <2b8>   DW_AT_data_member_location: 2
 <2><2b9>: Abbrev Number: 7 (DW_TAG_member)
    <2ba>   DW_AT_name        : (indirect string, offset: 0x8989): st_mode
    <2be>   DW_AT_decl_file   : 8
    <2bf>   DW_AT_decl_line   : 31
    <2c0>   DW_AT_decl_column : 10
    <2c1>   DW_AT_type        : <0x27a>
    <2c5>   DW_AT_data_member_location: 4
 <2><2c6>: Abbrev Number: 7 (DW_TAG_member)
    <2c7>   DW_AT_name        : (indirect string, offset: 0x7383): st_nlink
    <2cb>   DW_AT_decl_file   : 8
    <2cc>   DW_AT_decl_line   : 32
    <2cd>   DW_AT_decl_column : 11
    <2ce>   DW_AT_type        : <0x286>
    <2d2>   DW_AT_data_member_location: 8
 <2><2d3>: Abbrev Number: 7 (DW_TAG_member)
    <2d4>   DW_AT_name        : (indirect string, offset: 0x4be7): st_uid
    <2d8>   DW_AT_decl_file   : 8
    <2d9>   DW_AT_decl_line   : 33
    <2da>   DW_AT_decl_column : 10
    <2db>   DW_AT_type        : <0x262>
    <2df>   DW_AT_data_member_location: 10
 <2><2e0>: Abbrev Number: 7 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x5eec): st_gid
    <2e5>   DW_AT_decl_file   : 8
    <2e6>   DW_AT_decl_line   : 34
    <2e7>   DW_AT_decl_column : 10
    <2e8>   DW_AT_type        : <0x26e>
    <2ec>   DW_AT_data_member_location: 12
 <2><2ed>: Abbrev Number: 7 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x4d7e): st_rdev
    <2f2>   DW_AT_decl_file   : 8
    <2f3>   DW_AT_decl_line   : 35
    <2f4>   DW_AT_decl_column : 10
    <2f5>   DW_AT_type        : <0x256>
    <2f9>   DW_AT_data_member_location: 14
 <2><2fa>: Abbrev Number: 7 (DW_TAG_member)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x480e): st_size
    <2ff>   DW_AT_decl_file   : 8
    <300>   DW_AT_decl_line   : 36
    <301>   DW_AT_decl_column : 10
    <302>   DW_AT_type        : <0x24a>
    <306>   DW_AT_data_member_location: 16
 <2><307>: Abbrev Number: 7 (DW_TAG_member)
    <308>   DW_AT_name        : (indirect string, offset: 0x92b6): st_atim
    <30c>   DW_AT_decl_file   : 8
    <30d>   DW_AT_decl_line   : 42
    <30e>   DW_AT_decl_column : 19
    <30f>   DW_AT_type        : <0x1f2>
    <313>   DW_AT_data_member_location: 24
 <2><314>: Abbrev Number: 7 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x3fef): st_mtim
    <319>   DW_AT_decl_file   : 8
    <31a>   DW_AT_decl_line   : 43
    <31b>   DW_AT_decl_column : 19
    <31c>   DW_AT_type        : <0x1f2>
    <320>   DW_AT_data_member_location: 40
 <2><321>: Abbrev Number: 7 (DW_TAG_member)
    <322>   DW_AT_name        : (indirect string, offset: 0x3c03): st_ctim
    <326>   DW_AT_decl_file   : 8
    <327>   DW_AT_decl_line   : 44
    <328>   DW_AT_decl_column : 19
    <329>   DW_AT_type        : <0x1f2>
    <32d>   DW_AT_data_member_location: 56
 <2><32e>: Abbrev Number: 7 (DW_TAG_member)
    <32f>   DW_AT_name        : (indirect string, offset: 0x3c47): st_blksize
    <333>   DW_AT_decl_file   : 8
    <334>   DW_AT_decl_line   : 45
    <335>   DW_AT_decl_column : 17
    <336>   DW_AT_type        : <0x226>
    <33a>   DW_AT_data_member_location: 72
 <2><33b>: Abbrev Number: 7 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0x3c52): st_blocks
    <340>   DW_AT_decl_file   : 8
    <341>   DW_AT_decl_line   : 46
    <342>   DW_AT_decl_column : 12
    <343>   DW_AT_type        : <0x21a>
    <347>   DW_AT_data_member_location: 76
 <2><348>: Abbrev Number: 7 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0x4bee): st_spare4
    <34d>   DW_AT_decl_file   : 8
    <34e>   DW_AT_decl_line   : 48
    <34f>   DW_AT_decl_column : 9
    <350>   DW_AT_type        : <0x356>
    <354>   DW_AT_data_member_location: 80
 <2><355>: Abbrev Number: 0
 <1><356>: Abbrev Number: 8 (DW_TAG_array_type)
    <357>   DW_AT_type        : <0x100>
    <35b>   DW_AT_sibling     : <0x366>
 <2><35f>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <360>   DW_AT_type        : <0x13b>
    <364>   DW_AT_upper_bound : 1
 <2><365>: Abbrev Number: 0
 <1><366>: Abbrev Number: 10 (DW_TAG_structure_type)
    <367>   DW_AT_name        : tms
    <36b>   DW_AT_byte_size   : 16
    <36c>   DW_AT_decl_file   : 9
    <36d>   DW_AT_decl_line   : 17
    <36e>   DW_AT_decl_column : 8
    <36f>   DW_AT_sibling     : <0x3a8>
 <2><373>: Abbrev Number: 7 (DW_TAG_member)
    <374>   DW_AT_name        : (indirect string, offset: 0x5801): tms_utime
    <378>   DW_AT_decl_file   : 9
    <379>   DW_AT_decl_line   : 18
    <37a>   DW_AT_decl_column : 10
    <37b>   DW_AT_type        : <0x232>
    <37f>   DW_AT_data_member_location: 0
 <2><380>: Abbrev Number: 7 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0x5716): tms_stime
    <385>   DW_AT_decl_file   : 9
    <386>   DW_AT_decl_line   : 19
    <387>   DW_AT_decl_column : 10
    <388>   DW_AT_type        : <0x232>
    <38c>   DW_AT_data_member_location: 4
 <2><38d>: Abbrev Number: 7 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x3fb7): tms_cutime
    <392>   DW_AT_decl_file   : 9
    <393>   DW_AT_decl_line   : 20
    <394>   DW_AT_decl_column : 10
    <395>   DW_AT_type        : <0x232>
    <399>   DW_AT_data_member_location: 8
 <2><39a>: Abbrev Number: 7 (DW_TAG_member)
    <39b>   DW_AT_name        : (indirect string, offset: 0x859b): tms_cstime
    <39f>   DW_AT_decl_file   : 9
    <3a0>   DW_AT_decl_line   : 21
    <3a1>   DW_AT_decl_column : 10
    <3a2>   DW_AT_type        : <0x232>
    <3a6>   DW_AT_data_member_location: 12
 <2><3a7>: Abbrev Number: 0
 <1><3a8>: Abbrev Number: 8 (DW_TAG_array_type)
    <3a9>   DW_AT_type        : <0x1c1>
    <3ad>   DW_AT_sibling     : <0x3b8>
 <2><3b1>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <3b2>   DW_AT_type        : <0x13b>
    <3b6>   DW_AT_upper_bound : 0
 <2><3b7>: Abbrev Number: 0
 <1><3b8>: Abbrev Number: 11 (DW_TAG_variable)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x6da6): __env
    <3bd>   DW_AT_decl_file   : 1
    <3be>   DW_AT_decl_line   : 81
    <3bf>   DW_AT_decl_column : 7
    <3c0>   DW_AT_type        : <0x3a8>
    <3c4>   DW_AT_external    : 1
    <3c4>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><3ca>: Abbrev Number: 11 (DW_TAG_variable)
    <3cb>   DW_AT_name        : (indirect string, offset: 0x4d19): environ
    <3cf>   DW_AT_decl_file   : 1
    <3d0>   DW_AT_decl_line   : 82
    <3d1>   DW_AT_decl_column : 8
    <3d2>   DW_AT_type        : <0x3dc>
    <3d6>   DW_AT_external    : 1
    <3d6>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><3dc>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <3dd>   DW_AT_byte_size   : 4
    <3de>   DW_AT_type        : <0x1c1>
 <1><3e2>: Abbrev Number: 12 (DW_TAG_subprogram)
    <3e3>   DW_AT_external    : 1
    <3e3>   DW_AT_name        : (indirect string, offset: 0x4b63): __io_getchar
    <3e7>   DW_AT_decl_file   : 1
    <3e8>   DW_AT_decl_line   : 78
    <3e9>   DW_AT_decl_column : 12
    <3ea>   DW_AT_prototyped  : 1
    <3ea>   DW_AT_type        : <0x134>
    <3ee>   DW_AT_declaration : 1
 <1><3ee>: Abbrev Number: 12 (DW_TAG_subprogram)
    <3ef>   DW_AT_external    : 1
    <3ef>   DW_AT_name        : (indirect string, offset: 0x4c91): __errno
    <3f3>   DW_AT_decl_file   : 10
    <3f4>   DW_AT_decl_line   : 15
    <3f5>   DW_AT_decl_column : 13
    <3f6>   DW_AT_prototyped  : 1
    <3f6>   DW_AT_type        : <0x3fa>
    <3fa>   DW_AT_declaration : 1
 <1><3fa>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <3fb>   DW_AT_byte_size   : 4
    <3fc>   DW_AT_type        : <0x134>
 <1><400>: Abbrev Number: 13 (DW_TAG_subprogram)
    <401>   DW_AT_external    : 1
    <401>   DW_AT_name        : (indirect string, offset: 0x52e3): _execve
    <405>   DW_AT_decl_file   : 1
    <406>   DW_AT_decl_line   : 194
    <407>   DW_AT_decl_column : 5
    <408>   DW_AT_prototyped  : 1
    <408>   DW_AT_type        : <0x134>
    <40c>   DW_AT_low_pc      : 0x0
    <410>   DW_AT_high_pc     : 0x22
    <414>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <416>   DW_AT_GNU_all_tail_call_sites: 1
    <416>   DW_AT_sibling     : <0x448>
 <2><41a>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <41b>   DW_AT_name        : (indirect string, offset: 0x7e7e): name
    <41f>   DW_AT_decl_file   : 1
    <420>   DW_AT_decl_line   : 194
    <421>   DW_AT_decl_column : 19
    <422>   DW_AT_type        : <0x1c1>
    <426>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><429>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <42a>   DW_AT_name        : (indirect string, offset: 0x64c0): argv
    <42e>   DW_AT_decl_file   : 1
    <42f>   DW_AT_decl_line   : 194
    <430>   DW_AT_decl_column : 32
    <431>   DW_AT_type        : <0x3dc>
    <435>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><438>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <439>   DW_AT_name        : env
    <43d>   DW_AT_decl_file   : 1
    <43e>   DW_AT_decl_line   : 194
    <43f>   DW_AT_decl_column : 45
    <440>   DW_AT_type        : <0x3dc>
    <444>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><447>: Abbrev Number: 0
 <1><448>: Abbrev Number: 16 (DW_TAG_subprogram)
    <449>   DW_AT_external    : 1
    <449>   DW_AT_name        : (indirect string, offset: 0x69df): _fork
    <44d>   DW_AT_decl_file   : 1
    <44e>   DW_AT_decl_line   : 188
    <44f>   DW_AT_decl_column : 5
    <450>   DW_AT_prototyped  : 1
